<?php

$lang['required'] 		= "Заповніть поле \"%s\".";
$lang['isset']			= "Поле \"%s\" має бути встановлене.";
$lang['valid_email']	= "Поле \"%s\" має бути правильною E-Mail адресою.";
$lang['valid_url'] 		= "Поле \"%s\" має бути правильним URL.";
$lang['min_length']		= "Поле \"%s\" не може містити менше \"%s\" символів.";
$lang['max_length']		= "Поле \"%s\" не може містити більше \"%s\" символів.";
$lang['exact_length']	= "Поле \"%s\" повинно містити \"%s\" символів.";
$lang['alpha']			= "Поле \"%s\" повинно містити лише латинські літери.";
$lang['alpha_numeric']	= "Поле \"%s\" повинно містити лише латинські літери та цифри.";
$lang['alpha_dash']		= "Поле \"%s\" повинно містити лише латинські літери, цифри, підкреслення та тире.";
$lang['numeric']		= "Поле \"%s\" повинно бути числом.";
$lang['matches']		= "Поле \"%s\" не співпадає з полем \"%s\".";
$lang['is_unique'] 		= "Поле \"%s\" має бути унікальним.";

$lang['valid_emails'] 		= "Поле \"%s\" має містити правильні E-Mail адреси.";
$lang['valid_ip'] 			= "Поле \"%s\" має бути правильним IP.";
$lang['is_numeric']			= "Поле \"%s\" має містити тільки цифри.";
$lang['integer']			= "Поле \"%s\" має містити тільки цілі числа.";
$lang['regex_match']		= "Поле \"%s\" має неправильний формат.";
$lang['is_natural']			= "Поле \"%s\" має містити лише невідємні чілі числа.";
$lang['is_natural_no_zero']	= "Поле \"%s\" має містити лише натуральні числа.";
$lang['decimal']			= "Поле \"%s\" має містити лише дійсні числа.";
$lang['less_than']			= "Поле \"%s\" має бути менше %s.";
$lang['greater_than']		= "Поле \"%s\" має бути більше %s.";

$lang['_unique_field']								= "Уже існує такий \"%s\", виберіть інший.";
$lang['_unique_field_for_edit']						= "Уже існує такий \"%s\", виберіть інший.";
$lang['_unique_slug']								= "Уже існує такий \"%s\", введіть іншу назву.";
$lang['_value_exists']								= "Уже існує такий \"%s\", введіть інший.";
$lang['_valid_captcha']								= "Код верифікації введено неправильно.";
$lang['_valid_login']								= "Невірний логін чи пароль.";
$lang['_isset_category']							= "Виберіть категорію.";
$lang['_valid_quiz_answer']							= "Виберіть відповідь.";
$lang['_quiz_could_be_active']						= "Ви не можете активувати Тест поки він не має мінімальної кількісті питань.";
$lang['_quiz_correct_answers_not_more_then_total']  = "Кількість правильних відповідей не може бути більше, ніж загальна кількість питань.";
$lang['_poll_could_be_active']    					= "Голосування має мати мінімум 2 відповіді щоб бути активним.";
$lang['valid_date']									= "Поле \"%s\" має мітити дату.";
$lang['_valid_youtube_url']    						= "Цей URL \"%s\" не є правильним URL для youtube.";
$lang['_ip_not_in_blacklist']                       = "Ваш IP-адресу у чорниому списоку.";


/* End of file form_validation_lang.php */
/* Location: ./application/language/english/form_validation_lang.php */