<?php

$lang['required'] 		= "Требуется указать \"%s\".";
$lang['isset']			= "\"%s\" должно содержать значение.";
$lang['valid_email']	= "\"%s\" должно быть правильним E-Mail адресом.";
$lang['valid_url'] 		= "\"%s\" должно быть правильним URL.";
$lang['min_length']		= "\"%s\" не может содержать меньше \"%s\" символов.";
$lang['max_length']		= "\"%s\" не может содержать меньше больше \"%s\" символов.";
$lang['exact_length']	= "\"%s\" должно содержать \"%s\" символов.";
$lang['alpha']			= "\"%s\" должно содержать только латинские буквы.";
$lang['alpha_numeric']	= "\"%s\" должно содержать только латинские буквы и цифры.";
$lang['alpha_dash']		= "\"%s\" должно содержать только латинские буквы, цифры, подчеркивание и тире.";
$lang['numeric']		= "\"%s\" должно быть числом.";
$lang['matches']		= "\"%s\" должно соответствовать \"%s\".";
$lang['is_unique'] 		= "\"%s\" должно быть уникальным.";

$lang['valid_emails'] 		= "\"%s\" должны содержать корректные почтовые адреса.";
$lang['valid_ip'] 			= "\"%s\" должно быть правильным  IP.";
$lang['is_numeric']			= "\"%s\" может содержать только цифры.";
$lang['integer']			= "\"%s\" должно быть целым числом.";
$lang['regex_match']		= "\"%s\" имеет неправильный формат.";
$lang['is_natural']			= "\"%s\" может содержать только положительные числа.";
$lang['is_natural_no_zero']	= "\"%s\" может содержать только положительные числа больше ноля.";
$lang['decimal']			= "\"%s\" может содержать только действительние числа.";
$lang['less_than']			= "\"%s\" должно быть меньше %s.";
$lang['greater_than']		= "\"%s\" должно быть больше %s.";

$lang['_unique_field']	                            = "Уже существует такой \"%s\", выберите другой.";
$lang['_unique_field_for_edit']                     = "Уже существует такой \"%s\", выберите другой.";
$lang['_unique_slug']	                            = "Уже существует такой \"%s\" введите другое название.";
$lang['_value_exists']	                            = "Уже существует такой \"%s\", выберите другой.";
$lang['_valid_captcha']	                            = "Код верификации введен неверно.";
$lang['_valid_login']	                            = "Неверный логин или пароль.";
$lang['_isset_category']	                        = "Выберите категорию.";
$lang['_valid_quiz_answer']	                        = "Выберите ответ.";
$lang['_quiz_could_be_active']	                    = "Вы не можете активировать Тест пока он не обладает минимальным количеством вопросов.";
$lang['_quiz_correct_answers_not_more_then_total']  = "Количество правильных ответов не может быть больше, чем общее количество вопросов.";
$lang['_poll_could_be_active']                      = "Голосование должно иметь минимум 2 ответа чтобы быть активным.";
$lang['valid_date']		                            = "\"%s\" должно содержать дату.";
$lang['_valid_youtube_url']    						= "Этот URL \"%s\" не является правильным URL для youtube.";
$lang['_ip_not_in_blacklist']                       = "Ваш IP-адрес у чорном списке.";


/* End of file form_validation_lang.php */
/* Location: ./application/language/english/form_validation_lang.php */